FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/АРММотивации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРММотивации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодСтандартный</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПараметрыНастройкиKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыНастройкиKPI</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановыеЗначенияKPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрыДляKPI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыНастройкиKPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/АРММотивации/Ext/ObjectModule.bsl
Функция ОбщийСписокKPI() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияKPI.Сотрудник КАК Сотрудник,
		|	НачисленияKPI.Должность КАК Должность,
		|	НачисленияKPI.Периодичность КАК Периодичность,
		|	НачисленияKPI.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	НачисленияKPI.Организация КАК Организация,
		|	НачисленияKPI.KPI КАК KPIПремиальнаяБаза,
		|	НачисленияKPI.Факт КАК ФактKPI,
		|	НачисленияKPI.План КАК ПланKPI,
		|	НачисленияKPI.Значение КАК ЗначениеKPI,
		|	НачисленияKPI.Вес КАК ВесKPI,
		|	НачисленияKPI.КоэффициентБЧ КАК КоэффициентБЧKPI,
		|	НачисленияKPI.Сумма КАК СуммаKPI,
		|	НачисленияKPI.Регистратор КАК Регистратор,
		|	НачисленияKPI.Период КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ НачисленияKPI.ПроцентВыполненияФакт = 0
		|				И НЕ НачисленияKPI.База
		|			ТОГДА НачисленияKPI.ПроцентВыполненияФакт * 100
		|		ИНАЧЕ НачисленияKPI.ПроцентВыполненияФакт
		|	КОНЕЦ КАК ПроцентВыполненияФакт,
		|	ВЫБОР
		|		КОГДА НЕ НачисленияKPI.ПроцентВыполненияПремиальный = 0
		|				И НЕ НачисленияKPI.База
		|			ТОГДА НачисленияKPI.ПроцентВыполненияПремиальный * 100
		|		ИНАЧЕ НачисленияKPI.ПроцентВыполненияПремиальный
		|	КОНЕЦ КАК ПроцентВыполненияПремиальный,
		|	НачисленияKPI.База КАК База
		|ПОМЕСТИТЬ ВТ_Свод
		|ИЗ
		|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
		|ГДЕ
		|	НачисленияKPI.Период = &ПериодРегистрации
		|	И НачисленияKPI.Периодичность В(&Периодичность)
		|	И НачисленияKPI.Сотрудник = &Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свод.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ПараметрыНастройкиKPIСрезПоследних.Значение, 0) КАК СуммаПремиальнойБазы,
		|	ВТ_Свод.KPIПремиальнаяБаза КАК KPIПремиальнаяБаза
		|ПОМЕСТИТЬ ВТ_База
		|ИЗ
		|	ВТ_Свод КАК ВТ_Свод
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.KPI.ПоказателиДляРасчета КАК KPIПоказателиДляРасчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыНастройкиKPI.СрезПоследних КАК ПараметрыНастройкиKPIСрезПоследних
		|			ПО KPIПоказателиДляРасчета.Показатель = ПараметрыНастройкиKPIСрезПоследних.ПараметрыДляKPI
		|		ПО ВТ_Свод.KPIПремиальнаяБаза = KPIПоказателиДляРасчета.Ссылка
		|ГДЕ
		|	ПараметрыНастройкиKPIСрезПоследних.База
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свод.Сотрудник КАК Сотрудник,
		|	ВТ_Свод.Должность КАК Должность,
		|	ВТ_Свод.Периодичность КАК Периодичность,
		|	ВТ_Свод.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ВТ_Свод.Организация КАК Организация,
		|	ВТ_Свод.KPIПремиальнаяБаза КАК KPI,
		|	ВТ_Свод.ФактKPI КАК ФактKPI,
		|	ВТ_Свод.ПланKPI КАК ПланKPI,
		|	ВТ_Свод.ЗначениеKPI КАК ЗначениеKPI,
		|	ВТ_Свод.ВесKPI КАК ВесKPI,
		|	ВТ_Свод.КоэффициентБЧKPI КАК КоэффициентБЧKPI,
		|	ВТ_Свод.СуммаKPI КАК СуммаKPI,
		|	ВТ_Свод.Регистратор КАК Регистратор,
		|	ВТ_Свод.Период КАК Период,
		|	ВТ_Свод.ПроцентВыполненияФакт КАК ПроцентВыполненияФакт,
		|	ВТ_Свод.ПроцентВыполненияПремиальный КАК ПроцентВыполненияПремиальный,
		|	ВТ_Свод.База КАК База,
		|	ЕСТЬNULL(ВТ_База.СуммаПремиальнойБазы, 0) КАК СуммаПремиальнойБазы
		|ИЗ
		|	ВТ_Свод КАК ВТ_Свод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_База КАК ВТ_База
		|		ПО ВТ_Свод.Сотрудник = ВТ_База.Сотрудник
		|			И ВТ_Свод.KPIПремиальнаяБаза = ВТ_База.KPIПремиальнаяБаза";
	
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Общий");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");						
	ТабДок.Вывести(ОбластьШапка);				
	
	ОбластьСтрокаШапка = Макет.ПолучитьОбласть("СтрокаШапка");						
	ТабДок.Вывести(ОбластьСтрокаШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ОбщаяСуммаРезультат = 0; 
	ОбщаяСуммаРезультатKPI = 0; 
	
	Для Каждого ВыборкаДетальныеЗаписи ИЗ ТаблицаДетальныеЗаписи Цикл
		
		Если ВыборкаДетальныеЗаписи.База Тогда
			
			ОбластьСтрока.Параметры.Показатель = ВыборкаДетальныеЗаписи.KPI;
			ОбластьСтрока.Параметры.База = ВыборкаДетальныеЗаписи.СуммаПремиальнойБазы;
			ОбластьСтрока.Параметры.Вес = ВыборкаДетальныеЗаписи.ВесKPI;
			ОбластьСтрока.Параметры.План = ВыборкаДетальныеЗаписи.ПланKPI;
			ОбластьСтрока.Параметры.Факт = ВыборкаДетальныеЗаписи.ФактKPI;
			ОбластьСтрока.Параметры.ПроцентПремиальный = ВыборкаДетальныеЗаписи.ПроцентВыполненияПремиальный;
			
			ОбластьСтрока.Параметры.Результат = ВыборкаДетальныеЗаписи.ЗначениеKPI;
			ОбщаяСуммаРезультат = ОбщаяСуммаРезультат + ВыборкаДетальныеЗаписи.ЗначениеKPI;
			
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЕсли;
   
	КонецЦикла;
	
	ОбластьСтрокаШапкаKPI = Макет.ПолучитьОбласть("СтрокаШапкаKPI");						
	ТабДок.Вывести(ОбластьСтрокаШапкаKPI);
	
	ОбластьСтрокаKPI = Макет.ПолучитьОбласть("СтрокаKPI");

	Для Каждого ВыборкаДетальныеЗаписи ИЗ ТаблицаДетальныеЗаписи Цикл
		
		Если НЕ ВыборкаДетальныеЗаписи.База Тогда
			
			ОбластьСтрокаKPI.Параметры.ПоказательKPI = ВыборкаДетальныеЗаписи.KPI;
			ОбластьСтрокаKPI.Параметры.БазаKPI = ВыборкаДетальныеЗаписи.СуммаПремиальнойБазы;
			ОбластьСтрокаKPI.Параметры.ВесKPI = ВыборкаДетальныеЗаписи.ВесKPI;
			ОбластьСтрокаKPI.Параметры.ПланKPI = ВыборкаДетальныеЗаписи.ПланKPI;
			ОбластьСтрокаKPI.Параметры.ФактKPI = ВыборкаДетальныеЗаписи.ФактKPI;
			ОбластьСтрокаKPI.Параметры.ПроцентПремиальныйKPI = ВыборкаДетальныеЗаписи.ПроцентВыполненияПремиальный;
			
			ОбластьСтрокаKPI.Параметры.РезультатKPI = ВыборкаДетальныеЗаписи.СуммаKPI;
			ОбщаяСуммаРезультатKPI = ОбщаяСуммаРезультатKPI + ВыборкаДетальныеЗаписи.СуммаKPI;
			
			ТабДок.Вывести(ОбластьСтрокаKPI);		
			
		КонецЕсли;
		
	КонецЦикла;

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Если НЕ ОбщаяСуммаРезультатKPI = 0 Тогда
		ОбластьПодвал.Параметры.РезультатИтог = ОбщаяСуммаРезультатKPI; 
	Иначе	
		ОбластьПодвал.Параметры.РезультатИтог = ОбщаяСуммаРезультат; 
	КонецЕсли;

	ТабДок.Вывести(ОбластьПодвал);		

	Возврат ТабДок;
	
КонецФункции	

Функция ПремиальнаяБазаKPI() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияKPI.Сотрудник КАК Сотрудник,
		|	НачисленияKPI.Должность КАК Должность,
		|	НачисленияKPI.Периодичность КАК Периодичность,
		|	НачисленияKPI.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	НачисленияKPI.Организация КАК Организация,
		|	НачисленияKPI.KPI КАК KPIПремиальнаяБаза,
		|	НачисленияKPI.Факт КАК ФактKPI,
		|	НачисленияKPI.План КАК ПланKPI,
		|	НачисленияKPI.Значение КАК ЗначениеKPI,
		|	НачисленияKPI.Вес КАК ВесKPI,
		|	НачисленияKPI.КоэффициентБЧ КАК КоэффициентБЧKPI,
		|	НачисленияKPI.Сумма КАК СуммаKPI,
		|	НачисленияKPI.Регистратор КАК Регистратор,
		|	НачисленияKPI.Период КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ НачисленияKPI.ПроцентВыполненияФакт = 0
		|				И НЕ НачисленияKPI.База
		|			ТОГДА НачисленияKPI.ПроцентВыполненияФакт * 100
		|		ИНАЧЕ НачисленияKPI.ПроцентВыполненияФакт
		|	КОНЕЦ КАК ПроцентВыполненияФакт,
		|	ВЫБОР
		|		КОГДА НЕ НачисленияKPI.ПроцентВыполненияПремиальный = 0
		|				И НЕ НачисленияKPI.База
		|			ТОГДА НачисленияKPI.ПроцентВыполненияПремиальный * 100
		|		ИНАЧЕ НачисленияKPI.ПроцентВыполненияПремиальный
		|	КОНЕЦ КАК ПроцентВыполненияПремиальный,
		|	НачисленияKPI.База КАК База
		|ПОМЕСТИТЬ ВТ_Свод
		|ИЗ
		|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
		|ГДЕ
		|	НачисленияKPI.Период = &ПериодРегистрации
		|	И НачисленияKPI.Периодичность В(&Периодичность)
		|	И НачисленияKPI.Сотрудник = &Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свод.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ПараметрыНастройкиKPIСрезПоследних.Значение, 0) КАК СуммаПремиальнойБазы,
		|	ВТ_Свод.KPIПремиальнаяБаза КАК KPIПремиальнаяБаза
		|ПОМЕСТИТЬ ВТ_База
		|ИЗ
		|	ВТ_Свод КАК ВТ_Свод
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.KPI.ПоказателиДляРасчета КАК KPIПоказателиДляРасчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыНастройкиKPI.СрезПоследних КАК ПараметрыНастройкиKPIСрезПоследних
		|			ПО KPIПоказателиДляРасчета.Показатель = ПараметрыНастройкиKPIСрезПоследних.ПараметрыДляKPI
		|		ПО ВТ_Свод.KPIПремиальнаяБаза = KPIПоказателиДляРасчета.Ссылка
		|ГДЕ
		|	ПараметрыНастройкиKPIСрезПоследних.База
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свод.Сотрудник КАК Сотрудник,
		|	ВТ_Свод.Должность КАК Должность,
		|	ВТ_Свод.Периодичность КАК Периодичность,
		|	ВТ_Свод.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ВТ_Свод.Организация КАК Организация,
		|	ВТ_Свод.KPIПремиальнаяБаза КАК KPI,
		|	ВТ_Свод.ФактKPI КАК ФактKPI,
		|	ВТ_Свод.ПланKPI КАК ПланKPI,
		|	ВТ_Свод.ЗначениеKPI КАК ЗначениеKPI,
		|	ВТ_Свод.ВесKPI КАК ВесKPI,
		|	ВТ_Свод.КоэффициентБЧKPI КАК КоэффициентБЧKPI,
		|	ВТ_Свод.СуммаKPI КАК СуммаKPI,
		|	ВТ_Свод.Регистратор КАК Регистратор,
		|	ВТ_Свод.Период КАК Период,
		|	ВТ_Свод.ПроцентВыполненияФакт КАК ПроцентВыполненияФакт,
		|	ВТ_Свод.ПроцентВыполненияПремиальный КАК ПроцентВыполненияПремиальный,
		|	ВТ_Свод.База КАК База,
		|	ЕСТЬNULL(ВТ_База.СуммаПремиальнойБазы, 0) КАК СуммаПремиальнойБазы
		|ИЗ
		|	ВТ_Свод КАК ВТ_Свод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_База КАК ВТ_База
		|		ПО ВТ_Свод.Сотрудник = ВТ_База.Сотрудник
		|			И ВТ_Свод.KPIПремиальнаяБаза = ВТ_База.KPIПремиальнаяБаза
		|ГДЕ
		|	ВТ_Свод.База";
	
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ПремиальнаяБаза");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");						
	ТабДок.Вывести(ОбластьШапка);				

	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ОбщаяСуммаРезультат = 0; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
       ОбластьСтрока.Параметры.ПоказательKPI = ВыборкаДетальныеЗаписи.KPI;
       ОбластьСтрока.Параметры.База = ВыборкаДетальныеЗаписи.СуммаПремиальнойБазы;
       ОбластьСтрока.Параметры.ПланKPI = ВыборкаДетальныеЗаписи.ПланKPI;
       ОбластьСтрока.Параметры.ФактKPI = ВыборкаДетальныеЗаписи.ФактKPI;
       ОбластьСтрока.Параметры.ПроцентПремиальныйKPI = ВыборкаДетальныеЗаписи.ПроцентВыполненияПремиальный;
	   ОбластьСтрока.Параметры.Результат = ВыборкаДетальныеЗаписи.ЗначениеKPI;
	   ОбщаяСуммаРезультат = ОбщаяСуммаРезультат + ВыборкаДетальныеЗаписи.ЗначениеKPI;
	   
	   ТабДок.Вывести(ОбластьСтрока);		
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    ОбластьПодвал.Параметры.РезультатИтог = ОбщаяСуммаРезультат; 
	ТабДок.Вывести(ОбластьПодвал);		

	Возврат ТабДок;
	
КонецФункции

Функция СписокKPI() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияKPI.Сотрудник КАК Сотрудник,
		|	НачисленияKPI.Должность КАК Должность,
		|	НачисленияKPI.Периодичность КАК Периодичность,
		|	НачисленияKPI.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	НачисленияKPI.Организация КАК Организация,
		|	НачисленияKPI.KPI КАК KPIПремиальнаяБаза,
		|	НачисленияKPI.Факт КАК ФактKPI,
		|	НачисленияKPI.План КАК ПланKPI,
		|	НачисленияKPI.Значение КАК ЗначениеKPI,
		|	НачисленияKPI.Вес КАК ВесKPI,
		|	НачисленияKPI.КоэффициентБЧ КАК КоэффициентБЧKPI,
		|	НачисленияKPI.Сумма КАК СуммаKPI,
		|	НачисленияKPI.Регистратор КАК Регистратор,
		|	НачисленияKPI.Период КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ НачисленияKPI.ПроцентВыполненияФакт = 0
		|				И НЕ НачисленияKPI.База
		|			ТОГДА НачисленияKPI.ПроцентВыполненияФакт * 100
		|		ИНАЧЕ НачисленияKPI.ПроцентВыполненияФакт
		|	КОНЕЦ КАК ПроцентВыполненияФакт,
		|	ВЫБОР
		|		КОГДА НЕ НачисленияKPI.ПроцентВыполненияПремиальный = 0
		|				И НЕ НачисленияKPI.База
		|			ТОГДА НачисленияKPI.ПроцентВыполненияПремиальный * 100
		|		ИНАЧЕ НачисленияKPI.ПроцентВыполненияПремиальный
		|	КОНЕЦ КАК ПроцентВыполненияПремиальный,
		|	НачисленияKPI.База КАК База
		|ПОМЕСТИТЬ ВТ_Свод
		|ИЗ
		|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
		|ГДЕ
		|	НачисленияKPI.Период = &ПериодРегистрации
		|	И НачисленияKPI.Периодичность В(&Периодичность)
		|	И НачисленияKPI.Сотрудник = &Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свод.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ПараметрыНастройкиKPIСрезПоследних.Значение, 0) КАК СуммаПремиальнойБазы,
		|	ВТ_Свод.KPIПремиальнаяБаза КАК KPIПремиальнаяБаза
		|ПОМЕСТИТЬ ВТ_База
		|ИЗ
		|	ВТ_Свод КАК ВТ_Свод
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.KPI.ПоказателиДляРасчета КАК KPIПоказателиДляРасчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыНастройкиKPI.СрезПоследних КАК ПараметрыНастройкиKPIСрезПоследних
		|			ПО KPIПоказателиДляРасчета.Показатель = ПараметрыНастройкиKPIСрезПоследних.ПараметрыДляKPI
		|		ПО ВТ_Свод.KPIПремиальнаяБаза = KPIПоказателиДляРасчета.Ссылка
		|ГДЕ
		|	ПараметрыНастройкиKPIСрезПоследних.База
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Свод.Сотрудник КАК Сотрудник,
		|	ВТ_Свод.Должность КАК Должность,
		|	ВТ_Свод.Периодичность КАК Периодичность,
		|	ВТ_Свод.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ВТ_Свод.Организация КАК Организация,
		|	ВТ_Свод.KPIПремиальнаяБаза КАК KPI,
		|	ВТ_Свод.ФактKPI КАК ФактKPI,
		|	ВТ_Свод.ПланKPI КАК ПланKPI,
		|	ВТ_Свод.ЗначениеKPI КАК ЗначениеKPI,
		|	ВТ_Свод.ВесKPI КАК ВесKPI,
		|	ВТ_Свод.КоэффициентБЧKPI КАК КоэффициентБЧKPI,
		|	ВТ_Свод.СуммаKPI КАК СуммаKPI,
		|	ВТ_Свод.Регистратор КАК Регистратор,
		|	ВТ_Свод.Период КАК Период,
		|	ВТ_Свод.ПроцентВыполненияФакт КАК ПроцентВыполненияФакт,
		|	ВТ_Свод.ПроцентВыполненияПремиальный КАК ПроцентВыполненияПремиальный,
		|	ВТ_Свод.База КАК База,
		|	ЕСТЬNULL(ВТ_База.СуммаПремиальнойБазы, 0) КАК СуммаПремиальнойБазы
		|ИЗ
		|	ВТ_Свод КАК ВТ_Свод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_База КАК ВТ_База
		|		ПО ВТ_Свод.Сотрудник = ВТ_База.Сотрудник
		|			И ВТ_Свод.KPIПремиальнаяБаза = ВТ_База.KPIПремиальнаяБаза
		|ГДЕ
		|	НЕ ВТ_Свод.База";
	
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("KPI");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");						
	ТабДок.Вывести(ОбластьШапка);				

	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	ОбщаяСуммаРезультат = 0; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
       ОбластьСтрока.Параметры.ПоказательKPI = ВыборкаДетальныеЗаписи.KPI;
       ОбластьСтрока.Параметры.Вес = ВыборкаДетальныеЗаписи.ВесKPI;
       ОбластьСтрока.Параметры.ПланKPI = ВыборкаДетальныеЗаписи.ПланKPI;
       ОбластьСтрока.Параметры.ФактKPI = ВыборкаДетальныеЗаписи.ФактKPI;
       ОбластьСтрока.Параметры.ПроцентПремиальныйKPI = ВыборкаДетальныеЗаписи.ПроцентВыполненияПремиальный;
       ОбластьСтрока.Параметры.Результат = ВыборкаДетальныеЗаписи.СуммаKPI;
	   
	   ОбщаяСуммаРезультат = ОбщаяСуммаРезультат + ВыборкаДетальныеЗаписи.СуммаKPI;
	   
	   ТабДок.Вывести(ОбластьСтрока);		
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    ОбластьПодвал.Параметры.РезультатИтог = ОбщаяСуммаРезультат; 
	ТабДок.Вывести(ОбластьПодвал);		

	Возврат ТабДок;
	
КонецФункции

Функция Рейтинг(Выработка) Экспорт 
	
	ТЗДиаграммы=Новый ТаблицаЗначений;
    ТЗДиаграммы.Колонки.Добавить("Серия");
    ТЗДиаграммы.Колонки.Добавить("Точка");
    ТЗДиаграммы.Колонки.Добавить("Ресурс");
	
	ЗаполнитьДаннымиДляГрафика(ТЗДиаграммы, Выработка);
	
	Возврат ТЗДиаграммы;
	
КонецФункции	

Процедура ЗаполнитьДаннымиДляГрафика(ТЗДиаграммы, Выработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДетализацияВыработки.Сотрудник КАК Сотрудник,
	|	СУММА(ДетализацияВыработки.Выработка) КАК Выработка
	|ИЗ
	|	РегистрСведений.ДетализацияВыработки КАК ДетализацияВыработки
	|ГДЕ
	|	ДетализацияВыработки.Период = &Период
	|	И ДетализацияВыработки.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетализацияВыработки.Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выработка = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДетализацияВыработки.Сотрудник КАК Сотрудник,
		|	СУММА(ДетализацияВыработки.Выработка) КАК Выработка
		|ИЗ
		|	РегистрСведений.ДетализацияВыработки КАК ДетализацияВыработки
		|ГДЕ
		|	ДетализацияВыработки.Период = &Период
		|	И ДетализацияВыработки.Сотрудник.Подразделение = &Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	ДетализацияВыработки.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выработка УБЫВ";
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаВыработки = РезультатЗапроса.Выгрузить();
		
		Для Каждого Строка ИЗ ТаблицаВыработки Цикл 
			
			НоваяСтрока = ТЗДиаграммы.Добавить();
			НоваяСтрока.Серия = "Н/Ч";
			НоваяСтрока.Точка = Строка(Мотивация.ФИО(Строка.Сотрудник));
			НоваяСтрока.Ресурс = Строка.Выработка;
			
		КонецЦикла;	
		
	Иначе
		
		Выработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияKPI.Сотрудник КАК Сотрудник,
		|	СУММА(НачисленияKPI.Значение * НачисленияKPI.Вес) КАК KPI
		|ИЗ
		|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
		|ГДЕ
		|	НачисленияKPI.Сотрудник = &Сотрудник
		|	И НачисленияKPI.Период = &Период
		|	И НЕ НачисленияKPI.База
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияKPI.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	KPI УБЫВ";
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачисленияKPI.Сотрудник КАК Сотрудник,
			|	СУММА(НачисленияKPI.Значение * НачисленияKPI.Вес) КАК KPI
			|ИЗ
			|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
			|ГДЕ
			|	НачисленияKPI.Сотрудник.Подразделение = &Подразделение
			|	И НачисленияKPI.Период = &Период
			|	И НЕ НачисленияKPI.База
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияKPI.Сотрудник
			|
			|УПОРЯДОЧИТЬ ПО
			|	KPI УБЫВ";
			
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
			
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаKPI = РезультатЗапроса.Выгрузить();
			
			Для Каждого Строка ИЗ ТаблицаKPI Цикл 
				
				НоваяСтрока = ТЗДиаграммы.Добавить();
				НоваяСтрока.Серия = "KPI";
				НоваяСтрока.Точка = Строка(Мотивация.ФИО(Строка.Сотрудник));
				НоваяСтрока.Ресурс = Строка.KPI;
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьПланФакт() Экспорт 
	
	ТЗДиаграммы=Новый ТаблицаЗначений;
    ТЗДиаграммы.Колонки.Добавить("СерияПлан");
    ТЗДиаграммы.Колонки.Добавить("ТочкаПлан");
    ТЗДиаграммы.Колонки.Добавить("РесурсПлан");
	
	ТЗДиаграммы.Колонки.Добавить("СерияФакт");
    ТЗДиаграммы.Колонки.Добавить("ТочкаФакт");
    ТЗДиаграммы.Колонки.Добавить("РесурсФакт");

	ЗаполнитьДаннымиПланФактДляГрафика(ТЗДиаграммы);
	
	Возврат ТЗДиаграммы;
	
КонецФункции	

Процедура ЗаполнитьДаннымиПланФактДляГрафика(ТЗДиаграммы)
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияKPI.Сотрудник КАК Сотрудник,
		|	НачисленияKPI.План КАК План,
		|	НачисленияKPI.Факт КАК Факт,
		|	НачисленияKPI.Период КАК Период,
		|	НачисленияKPI.База КАК База
		|ИЗ
		|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
		|ГДЕ
		|	НачисленияKPI.Сотрудник = &Сотрудник
		|	И НачисленияKPI.Период МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И НЕ НачисленияKPI.База
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияKPI.Сотрудник,
		|	НачисленияKPI.План,
		|	НачисленияKPI.Факт,
		|	НачисленияKPI.Период,
		|	НачисленияKPI.База";
		
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(Период,-6));
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(Период));
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачисленияKPI.База КАК База,
			|	НачисленияKPI.Период КАК Период,
			|	СУММА(НачисленияKPI.План) КАК План,
			|	СУММА(НачисленияKPI.Факт) КАК Факт
			|ИЗ
			|	РегистрСведений.НачисленияKPI КАК НачисленияKPI
			|ГДЕ
			|	НачисленияKPI.Сотрудник.Подразделение = &Подразделение
			|	И НачисленияKPI.Период МЕЖДУ &ПериодНачало И &ПериодКонец
			|	И НЕ НачисленияKPI.База
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияKPI.База,
			|	НачисленияKPI.Период
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
			Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(Период,-6));
			Запрос.УстановитьПараметр("ПериодКонец", ДобавитьМесяц(Период,-1));
			Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
			
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаKPI = РезультатЗапроса.Выгрузить();
			
			ТаблицаПериодов = Новый ТаблицаЗначений;
			ТаблицаПериодов.Колонки.Добавить("Период");
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
            НоваяСтрока.Период = ДобавитьМесяц(Период,-6);
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
            НоваяСтрока.Период = ДобавитьМесяц(Период,-5);
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
            НоваяСтрока.Период = ДобавитьМесяц(Период,-4);
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
            НоваяСтрока.Период = ДобавитьМесяц(Период,-3);
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
            НоваяСтрока.Период = ДобавитьМесяц(Период,-2);
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
            НоваяСтрока.Период = ДобавитьМесяц(Период,-1);
			
			Для Каждого Строка ИЗ ТаблицаПериодов Цикл 
				
				ПараметрыОтбораKPI = Новый Структура;
				ПараметрыОтбораKPI.Вставить("Период", Строка.Период);
				
				НайденаяСтрокаKPI = ТаблицаKPI.НайтиСтроки(ПараметрыОтбораKPI);
				
				НоваяСтрока = ТЗДиаграммы.Добавить();
				НоваяСтрока.СерияПлан = "План";
				НоваяСтрока.ТочкаПлан = Формат(Строка.Период,"ДФ=""ММММ гггг 'г.'""");
				
				Если НЕ НайденаяСтрокаKPI.Количество() = 0 Тогда
					
					НоваяСтрока.РесурсПлан = НайденаяСтрокаKPI[0].План;
					
				Иначе
					
					НоваяСтрока.РесурсПлан = 0;
					
				КонецЕсли;
			
				НоваяСтрока = ТЗДиаграммы.Добавить();
				НоваяСтрока.СерияФакт = "Факт";
				НоваяСтрока.ТочкаФакт = Формат(Строка.Период,"ДФ=""ММММ гггг 'г.'""");
				
				Если НЕ НайденаяСтрокаKPI.Количество() = 0 Тогда
					
					НоваяСтрока.РесурсФакт = НайденаяСтрокаKPI[0].Факт;
					
				Иначе
					
					НоваяСтрока.РесурсФакт = 0;
					
				КонецЕсли;
	
			КонецЦикла;	
			
		КонецЕсли;
	
КонецПроцедуры
